#### Terraform Plan `success`

<details><summary>Show plan</summary>

```
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.cloudflare_zone.main: Read complete after 1s [id=d6d3d7657a16a8f5650abce88f4ce603]
cloudflare_record.dkim_fm1: Refreshing state... [id=f448b309931fd44981db0dcff1736dad]
cloudflare_record.lhr2: Refreshing state... [id=b0b0e73af2b22612342b4658976a85b3]
cloudflare_record.dkim_fm3: Refreshing state... [id=d9a71ded6306e51ffb11b80da0ecc8b5]
cloudflare_record.www: Refreshing state... [id=13a02ea8fb89f8355e74d788ee0b9940]
cloudflare_record.dmarc: Refreshing state... [id=e4713053f2ebda61e3b1ccaea143cc77]
cloudflare_record.lhr2_aaaa: Refreshing state... [id=0dae59252d3a08acefd24564cc191349]
cloudflare_record.spf: Refreshing state... [id=021d305ece5fc6b062c83ad9c09ccd9c]
cloudflare_record.mx_2: Refreshing state... [id=fc8bb2e00bbea5c0af0a875026628683]
cloudflare_record.lhr2_wildcard_aaaa: Refreshing state... [id=8c4c66126b29554ced869e83e7048bd4]
cloudflare_record.dkim_fm2: Refreshing state... [id=5f6bf537b0341ec95c5260ab2762cb58]
cloudflare_record.google_verification: Refreshing state... [id=5eb495f66f25e2a4e19412c33cf2b681]
cloudflare_record.lhr2_wildcard: Refreshing state... [id=50ba09f7439412eb0659d61c35e1754d]
cloudflare_record.mx_1: Refreshing state... [id=4ab9a3ec39f3eca0eda1e948a417152b]
google_compute_managed_ssl_certificate.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/sslCertificates/simonandrews-ca-cert]
google_project_service.compute: Refreshing state... [id=simonandrews-ca-terraform/compute.googleapis.com]
google_project_service.iam: Refreshing state... [id=simonandrews-ca-terraform/iam.googleapis.com]
google_project_service.run: Refreshing state... [id=simonandrews-ca-terraform/run.googleapis.com]
google_project_service.cloudbuild: Refreshing state... [id=simonandrews-ca-terraform/cloudbuild.googleapis.com]
google_project_service.artifactregistry: Refreshing state... [id=simonandrews-ca-terraform/artifactregistry.googleapis.com]
google_compute_url_map.http_redirect: Refreshing state... [id=projects/simonandrews-ca-terraform/global/urlMaps/simonandrews-ca-http-redirect]
google_project_service.cloudresourcemanager: Refreshing state... [id=simonandrews-ca-terraform/cloudresourcemanager.googleapis.com]
google_compute_target_http_proxy.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/targetHttpProxies/simonandrews-ca-http-proxy]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/workloadIdentityPools/github-actions]
google_compute_global_address.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/addresses/simonandrews-ca-ip]
google_service_account.terraform: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_service_account.cloud_run: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-run@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_service_account.cloud_build: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_artifact_registry_repository.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/repositories/simonandrews-ca]
google_project_iam_member.terraform_sa["roles/compute.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/compute.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/run.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/run.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/cloudbuild.integrations.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/cloudbuild.integrations.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.serviceAccountUser"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountUser/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.securityAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.securityAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloud_run_v2_service.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca]
google_project_iam_member.terraform_sa["roles/cloudbuild.builds.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/cloudbuild.builds.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/serviceusage.serviceUsageAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.workloadIdentityPoolAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/storage.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/storage.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/artifactregistry.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/artifactregistry.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/compute.securityAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/compute.securityAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_service_account_iam_member.terraform_wif: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/terraform@simonandrews-ca-terraform.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/68732768207/locations/global/workloadIdentityPools/github-actions/attribute.repository/simon360/simonandrews.ca]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/workloadIdentityPools/github-actions/providers/github-actions]
google_project_iam_member.cloud_build_artifact_registry: Refreshing state... [id=simonandrews-ca-terraform/roles/artifactregistry.writer/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloudbuild_trigger.preview: Refreshing state... [id=projects/simonandrews-ca-terraform/triggers/43fb9c95-9879-40fc-8df1-1f8ef0970203]
google_project_iam_member.cloud_build_sa_user: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountUser/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_run_admin: Refreshing state... [id=simonandrews-ca-terraform/roles/run.admin/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_log_writer: Refreshing state... [id=simonandrews-ca-terraform/roles/logging.logWriter/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloudbuild_trigger.main: Refreshing state... [id=projects/simonandrews-ca-terraform/triggers/4efc2732-2d98-4855-9ba3-c34c87091264]
cloudflare_record.apex_a: Refreshing state... [id=c3c7d6f96a1b951584d5bb805ebc2b61]
google_compute_global_forwarding_rule.http: Refreshing state... [id=projects/simonandrews-ca-terraform/global/forwardingRules/simonandrews-ca-http]
google_compute_region_network_endpoint_group.cloud_run: Refreshing state... [id=projects/simonandrews-ca-terraform/regions/europe-west1/networkEndpointGroups/simonandrews-ca-neg]
google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca/roles/run.invoker/allUsers]
google_compute_backend_service.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/backendServices/simonandrews-ca-backend]
google_compute_url_map.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/urlMaps/simonandrews-ca-url-map]
google_compute_target_https_proxy.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/targetHttpsProxies/simonandrews-ca-https-proxy]
google_compute_global_forwarding_rule.https: Refreshing state... [id=projects/simonandrews-ca-terraform/global/forwardingRules/simonandrews-ca-https]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.cert_auth will be created
  + resource "cloudflare_record" "cert_auth" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (known after apply)
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 900
      + type            = (known after apply)
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # google_certificate_manager_certificate.main will be created
  + resource "google_certificate_manager_certificate" "main" {
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + id               = (known after apply)
      + location         = "global"
      + name             = "simonandrews-ca-cert"
      + project          = "simonandrews-ca-terraform"
      + san_dnsnames     = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }

      + managed {
          + authorization_attempt_info = (known after apply)
          + dns_authorizations         = (known after apply)
          + domains                    = [
              + "simonandrews.ca",
              + "*.simonandrews.ca",
            ]
          + provisioning_issue         = (known after apply)
          + state                      = (known after apply)
        }
    }

  # google_certificate_manager_certificate_map.main will be created
  + resource "google_certificate_manager_certificate_map" "main" {
      + create_time      = (known after apply)
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + gclb_targets     = (known after apply)
      + id               = (known after apply)
      + name             = "simonandrews-ca-cert-map"
      + project          = "simonandrews-ca-terraform"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
    }

  # google_certificate_manager_certificate_map_entry.apex will be created
  + resource "google_certificate_manager_certificate_map_entry" "apex" {
      + certificates     = (known after apply)
      + create_time      = (known after apply)
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + hostname         = "simonandrews.ca"
      + id               = (known after apply)
      + map              = "simonandrews-ca-cert-map"
      + name             = "simonandrews-ca-apex"
      + project          = "simonandrews-ca-terraform"
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
    }

  # google_certificate_manager_certificate_map_entry.wildcard will be created
  + resource "google_certificate_manager_certificate_map_entry" "wildcard" {
      + certificates     = (known after apply)
      + create_time      = (known after apply)
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + hostname         = "*.simonandrews.ca"
      + id               = (known after apply)
      + map              = "simonandrews-ca-cert-map"
      + name             = "simonandrews-ca-wildcard"
      + project          = "simonandrews-ca-terraform"
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
    }

  # google_certificate_manager_dns_authorization.main will be created
  + resource "google_certificate_manager_dns_authorization" "main" {
      + dns_resource_record = (known after apply)
      + domain              = "simonandrews.ca"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                  = (known after apply)
      + location            = "global"
      + name                = "simonandrews-ca-auth"
      + project             = "simonandrews-ca-terraform"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + type                = (known after apply)
    }

  # google_compute_managed_ssl_certificate.main will be destroyed
  # (because google_compute_managed_ssl_certificate.main is not in configuration)
  - resource "google_compute_managed_ssl_certificate" "main" {
      - certificate_id            = 2568117565338265104 -> null
      - creation_timestamp        = "2026-03-22T09:29:51.432-07:00" -> null
      - id                        = "projects/simonandrews-ca-terraform/global/sslCertificates/simonandrews-ca-cert" -> null
      - name                      = "simonandrews-ca-cert" -> null
      - project                   = "simonandrews-ca-terraform" -> null
      - self_link                 = "https://www.googleapis.com/compute/v1/projects/simonandrews-ca-terraform/global/sslCertificates/simonandrews-ca-cert" -> null
      - subject_alternative_names = [] -> null
      - type                      = "MANAGED" -> null
        # (2 unchanged attributes hidden)

      - managed {
          - domains = [
              - "simonandrews.ca",
              - "www.simonandrews.ca",
            ] -> null
        }
    }

  # google_compute_target_https_proxy.main will be updated in-place
  ~ resource "google_compute_target_https_proxy" "main" {
      + certificate_map                  = (known after apply)
        id                               = "projects/simonandrews-ca-terraform/global/targetHttpsProxies/simonandrews-ca-https-proxy"
        name                             = "simonandrews-ca-https-proxy"
      ~ ssl_certificates                 = [
          - "https://www.googleapis.com/compute/v1/projects/simonandrews-ca-terraform/global/sslCertificates/simonandrews-ca-cert",
        ]
        # (14 unchanged attributes hidden)
    }

  # google_project_service.certificatemanager will be created
  + resource "google_project_service" "certificatemanager" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "simonandrews-ca-terraform"
      + service            = "certificatemanager.googleapis.com"
    }

Plan: 7 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>